print("-------------------------------------------第一题-------------------------------------\n")
# 1.练习:
#   任意输入一个字符串，判断这个字符串中有几个空格' '
#   (要求不允许用S.count方法)
#   建议使用for语句实现
s1 = input("请输入一个字符串：")
s1_count = 0
for s1_i in s1:
	if s1_i == " ":
		s1_count += 1
else:
	print("字符串中总共有 %d  个字符串！" % s1_count)


print("\n\n-------------------------------------------第二题-------------------------------------\n")
# 2.练习:
#   (1). 求 100 以内有哪儿些整数与　自身 + 1 的乘积再对11 求余结果等于8?
# 
#   (2). 计算 1 + 3 + 5 + 7 +.... + 99的和
#     用while 和 for语句两种方法来实现

print("符合要求的数有：",end=" ")
for s2_1 in range(100):
	s2_2 = s2_1 * (s2_1+1) % 11
	if s2_2 == 8:
		print(s2_1,end=" ")
else:
	print()

s2_count = 0
for s2_3 in range(1,100,2):
	s2_count += s2_3
else:
	print("和为：",s2_count)
	
print("\n\n-------------------------------------------第三题-------------------------------------\n")
# 3.练习:
#   (1) 写程序．输入一个整数n 代表正方形的宽度和高度．
#   打印数字组成的正方形:
#    如
#      输入: 5
#    打印:
#     1 2 3 4 5
#     1 2 3 4 5
#     1 2 3 4 5
#     1 2 3 4 5
#     1 2 3 4 5
#    　　输入: 4 
#    打印:
#     1 2 3 4
#     1 2 3 4
#     1 2 3 4
#     1 2 3 4

s3_1 = int(input("请输入正方形的边长："))

for s3_len in range(1,6):
	for s3_wid in range(1,6):
		print(s3_wid,end=" ")
	else:
		print()
else:
	print("\n已经全部输出完毕")


#   (2) 写程序．输入一个整数n 代表正方形的宽度和高度．
#   打印数字组成的正方形:
#    如
#      输入: 5
#    打印:
#     1 2 3 4 5
#     2 3 4 5 6
#     3 4 5 6 7
#     4 5 6 7　8
#     5 6 7　8 9
#    　　输入: 4 
#    打印:
#     1 2 3 4
#     2 3 4 5
#     3 4 5 6
#     4 5 6 7

s3_2 = int(input("请输入正方形的边长："))
for s3_i in range(5):
	s3_m = s3_i + 1
	for s3_j in range(s3_m,s3_m+s3_2):
		print(s3_j,end=" ")
	else:
		print(" ")
else:
	print("已经全部输出完毕")
	
print("\n\n-------------------------------------------第四题-------------------------------------\n")
# 4.练习:
#   输入一个整数用begin绑定，再输入一个整数用end绑定，打印出从begin~end(包含end)的所有偶数
#     (建议用continue语句跳过奇数)

s4_begin = int(input("请输入开始的数字："))
s4_end = int(input("请输入结束的数字："))

print("打印从开始到结束数字之间所有的整数：")
for s4_i in range(s4_begin,s4_end+1):
	if s4_i % 2 == 0:
		print(s4_i,end=" ")
	else:
		continue
else:
	print("\n已经全部输出完毕")
	
	
print("\n\n-------------------------------------------第五题-------------------------------------\n")
# 5.练习:
#   求 1 ~ 100(包含100) 之间所有不能被5,7,11整除的数的和是多少?
#     (建议用continue语句实现)	

s4_count = 0
for s4_i in range(1,101):
	if (s4_i%5==0) or (s4_i%7==0) or (s4_i%11==0):
		continue
	else:
		s4_count += s4_i
else:
	print("满足条件的数的和是：%d" % s4_count)


print("\n\n-------------------------------------------第六题-------------------------------------\n")
# 6.练习:
#   输入一个整数n, 判断这个整数是否是素数(prime)
#     (素数是指只能被1 和自身整除的数)
#     如:
#       2 3 5 7 11...
#     方法：
#       用排除法.一但n能被2~n-1的数整除就不是素数，否则就一定是素数

s5_n = int(input("请输入一个整数："))

for s5_i in (2,s5_n+1):
	if s5_n % s5_i == 0:
		print("%d 不是一个素数" % s5_n)
		break
	else:
		continue
else:
	print("%d 是一个素数" % s5_n)

print("\n\n-------------------------------------------第七题-------------------------------------\n")
# 7. 输入一个整数，代表树干的高度.
#     打印一棵"圣诞树"
#     如:
#      输入:2
#     打印
#       *
#      ***
#       *
#       *
#      输入:3
#     打印
#        *
#       ***
#      *****
#        *
#        *    
#        *
s6_h = int(input("请输入圣诞树的高度："))

for s6_i in range(s6_h*2):
	s6_len = 2*s6_h-1
	if s6_i < s6_h:
		s6_str = "*"+"*"*s6_i*2
		print(s6_str.center(s6_len))
	else:
		print("*".center(s6_len))


print("\n\n-------------------------------------------第八题-------------------------------------\n")
# 8.用循环语句生成如下字符串
#     'ABC.....XYZ'
#     'AaBbCc......XxYyZz'
#     提示:
#        用ord和chr函数结合循环语句实现
for s8_i in range(ord("A"),ord("Z")+1):
	print(chr(s8_i),chr(s8_i+32),sep="",end="")
else:
	print("\n已经全部输出完毕")
	

print("\n\n-------------------------------------------第九题-------------------------------------\n")
# 9.算出 100 ~ 999 以内的水仙花数(Narcissistic number)
#      水仙花数是指百位的3次方加上十位的3次方加上个位的3次方等于原数的数字
#        例如:
#          153 等于 1**3 + 5**3 + 3**3
#      参考答案:
#        153, 370, ...

print("水仙花数为：")
for s9_i in range(100,1000):
	s9_ones = s9_i % 10
	s9_tens = (s9_i % 100 - s9_ones)//10
	s9_hundreds = (s9_i%1000-(s9_tens*10+s9_ones))//100
	s9_result = s9_ones**3+s9_tens**3+s9_hundreds**3
	if s9_result == s9_i:
		print(s9_i,end=" ")
else:
	print("\n已经全部输出完毕")
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	