
print("-------------------------------------------第一题-------------------------------------\n")
#  1.输入一个字符串
#  	（1）判断您输入的字符串有几个空格
#  	（2）将原字符串的左右空白字符去掉，打印出有效字符的长度
#  	（3）判断您输入的是否是数字

s1_1=input("请输入一个字符串：")
print("您输入的字符串有 ",s1_1.count(" "),' 空格。')
s1_2=s1_1.strip()
print("有效字符串的长度为：",len(s1_2),"")
if s1_1.isdigit() :
	print("您输入的全是数字")
else:
	print("您输入的不全是数字")
	



print("\n\n-------------------------------------------第二题-------------------------------------\n")
# 2.输入三行文字，让这些文字依次以20字符的宽度右对齐输出.
# 	如：
# 	（1）请输入第1行: hello world
# 	（2）请输入第2行: abcd
# 	（3）请输入第3行: a
# 	输出结果为:
#            hello world
#                   abcd
#                      a
#     做完上面的题后再思考:
#     	能否以最长字符串的长度进行右对齐显示(左侧填充空格)
		

s2_1=input("请输入第一行文字：")
s2_2=input("请输入第二行文字：")
s2_3=input("请输入第三行文字：")
s2_4="左对齐输出字符：\n%20s\n%20s\n%20s\n"
s2_5="右对齐输出字符：\n%-20s\n%-20s\n%-20s\n"
print(s2_4 % (s2_1,s2_2,s2_3))
print(s2_5 % (s2_1,s2_2,s2_3))



print("\n\n-------------------------------------------第三题-------------------------------------\n")
# 编写程序，用while语句解决下面的问题
#   问题:
#     输入一个数用n绑定,打印出n行的"hello world!"

s3_1 = int(input("请输入一个整数："))
s3_i = 1
while s3_i<=s3_1:
	print("第",s3_i,"行：hello world!")
	s3_i += 1
else:
	print("已经全部输出完毕！")
	


print("\n\n-------------------------------------------第四题-------------------------------------\n")
# 输入一个整数,用end变量绑定，打印出 1~end的所有整数，(包含end)

s4_1=int(input("请输入一个整数："))
s4_i=1

while s4_i<=s4_1:
	print(s4_i,end=" ")
	s4_i += 1
else:
	print("\n已经全部输出完毕")
	



print("\n\n-------------------------------------------第五题-------------------------------------\n")
# 写程序，输入二个整数，第一个用begin绑定，第二个用end变量绑定，
# 打印出 begin~end的所有的整数

s5_begin=int(input("请输入开始数字："))
s5_end=int(input("请输入终止数字："))

while s5_begin <= s5_end:
	print(s5_begin,end=" ")
	s5_begin += 1
else:
	print("\n已经全部输出完毕")
	


print("\n\n-------------------------------------------第六题-------------------------------------\n")
# 打印 1 ~ 20的整数，打印在一行内显示，每个数字之间用一个空格分隔开
#   如:
#     1 2 3 4 5 6 ... 18 19 20
#  	(提示:print(.... , end=' ') 可以不换新行)
s6_i=1
while s6_i <= 20:
	print(s6_i,end=" ")
	s6_i += 1
else:
	print("\n已经全部输出完毕")

	
print("\n\n-------------------------------------------第七题-------------------------------------\n")
# 打印 1~ 20的整数，每行5个，打印四行，如:
#  	1 2 3 4 5
#  	6 7 8 9 10
#  	....
#  	....
#  	(注: while语句内可以嵌入if语句)
s7_i=1
while s7_i <= 20:
	print(s7_i,end=" ")
	if s7_i%5 == 0:
		print()
	s7_i += 1
else:
	print("已经全部输出完毕！")
		
print("\n\n-------------------------------------------第八题-------------------------------------\n")
# 用while语句打印 10 ~ 1的所有整数(包含1)	
s8_i = 10
while s8_i >= 1:
	print(s8_i,end=" ")
	s8_i -= 1
else:
	print("\n已经全部输出完毕")
		

print("\n\n-------------------------------------------第九题-------------------------------------\n")
# 写程序，用while循环来计算 
#    1 + 2 + 3 + 4 + ....+ 99 + 100的和
s9_i = 0
s9_j = 1
while s9_j <= 100:
	s9_i += s9_j
	s9_j += 1
else:
	print("结果是:",s9_i)
		

print("\n\n-------------------------------------------第十题-------------------------------------\n")
# 用while 语句实现打印三角形,输入一个整数，表示三角形的宽度和高度，
# 打印出相应的直角三角形
#   如:
#     请输入三角形宽度: 4
#   	打印如下:
#     *
#     **
#     ***
#     ****
s10_1 = int(input("请输入一个整数："))
s10_2 = 1
while s10_2 <= s10_1:
	print("*"*s10_2)
	s10_2 += 1
else:
	print("全部输出完毕")
		

print("\n\n-------------------------------------------第十一题-------------------------------------\n")
# 打印1~20 之间的整数打印在一行
#    1 2 3 4 .... 18 19 20
#    把以上的数据打印10行 
s11_1 = 0
s11_2 = 1
while s11_1 < 10:
	while s11_2 <= 20:
		print(s11_2,end=" ")
		s11_2 += 1
	else:
		s11_2 = 1
		print()
	s11_1 += 1
else:
	print("全部输出完毕")


print("\n\n-------------------------------------------第十二题-------------------------------------\n")
# 输入一个数，
# 如:
#   请输入: 5
# 打印如下正方形
#   1 2 3 4 5
#   1 2 3 4 5
#   1 2 3 4 5
#   1 2 3 4 5
#   1 2 3 4 5
# 如:
#   请输入: 4
# 打印如下:
#   1 2 3 4
#   1 2 3 4
#   1 2 3 4
#   1 2 3 4
s12_1 = int(input("请输入一个整数："))

s12_2 = 1
s12_3 = 0

while s12_3 < s12_1:
	while s12_2 <= s12_1:
		print(s12_2,end=" ")
		s12_2 += 1
	else:
		s12_2 = 1
		print()
	
	s12_3 += 1
else:
	print("已经全部输出完毕！")
	

print("\n\n-------------------------------------------第十三题-------------------------------------\n")
# 用字符串* 运算符打印三角形
#   要求输入一个整数，此整数代表此三角形离左侧的字节数
#   如:
#   	$ python3 tri_angle.py
#     请输入离左侧的距离: 3
#     则打印:
#           *
#          ***
#         *****
#        *******

s13_1 = int(input("请输入一个整数："))
s13_len = s13_1*2+1
s13_i = 0
while s13_i <= s13_1:
	s13_str = ("*"*s13_i)*2+"*"
	print(s13_str.center(s13_len))
	s13_i += 1
else:
	print("已经全部输出完毕！")

print("\n\n-------------------------------------------第十四题-------------------------------------\n")
# 每次输入一个整数,当输入负数时结束输入,当输入完成后，打印您输入的这些数的和
s14_count = 0
while True:
	s14_input = int(input("请输入一个整数："))
	if	s14_input < 0:
		print("输入的所有数之和是",s14_count,sep="：")
		break
	else:
		s14_count += s14_input


print("\n\n-------------------------------------------第十五题-------------------------------------\n")
# 写程序用while实现打印三角形。
#     要求输入一个整数表示三角形的宽度和高度,打印出如下的三种直角三角形
#     1)
#         *
#        **
#       ***
#      ****
#     2)
#      ****
#       ***
#        **
#         *
#     3) 
#      ****
#      ***
#      **
#      *
s15_inpup = int(input("请输一个整数表示等腰三角形的宽和高："))

print("第一种三角形：")
s15_i = 1
while s15_i <= s15_inpup:
	print("%*s" % (s15_inpup,"*"*s15_i))
	s15_i += 1
else:
	print()

print("第二种三角形：")
s15_i = s15_inpup
while s15_i > 0:
	print("%*s" % (s15_inpup,"*"*s15_i))
	s15_i -= 1
else:
	print()

print("第三种三角形")
s15_i = s15_inpup
while s15_i > 0:
	print("%-*s" % (s15_inpup,"*"*s15_i))
	s15_i -= 1
else:
	print("已经全部输出完毕！")

print("\n\n-------------------------------------------第十六题-------------------------------------\n")
# 写程序求多项式的和:
#     1/1 - 1/3 + 1/5 - 1/7 + 1/9 ... + 1/(2*n-1) 的和
#     n最大取： 1000000
#     1) 打印这个和
#     2) 打印这个和乘以4的值?(看看这个数眼熟不?)

s16_n = 2*1000000-1
s16_count=0
s16_j = 0
s16_i = 1
while s16_i <= s16_n:
	s16_count += (-1**s16_j)/s16_i
	s16_j += 1
	s16_i += 2
else:
	print("和是",s16_count,sep="：")
	print("四倍是",s16_count*4,sep="：")


	