print("-------------------------------------------第一题-------------------------------------\n")
# 1.已知有列表
#   L = [3, 5]
#   用索引和切片操作，将列表改为:
#   L = [1,2,3,4,5,6]
#   将列表反转(前后对调), 然后删除最后一个元素
#   print(L)  # [6,5,4,3,2]

l1_1 = [3,5]
l1_1[0:1] = [1,2,3]
l1_1[3:] = [4,5,6]

print("l的值是：%s" % str(l1_1))
l1_1[::-1] = l1_1

print("翻转之后l的值是：%s" % str(l1_1))


print("\n\n-------------------------------------------第二题-------------------------------------\n")
# 2. 写程序，让用户循环输入一些整数，当输入-1时结束输入，将这些整数存于列表L中
#   1) 打印您共输入了几个有效的数?
#   2) 打印您输入的数的最大数是多少?
#   3) 打印您输入的数的最小数是多少?
#   4) 打印您输入这些数的平均值S

l2 = []
while True:
	s2 = int(input("请您输入一个整数："))
	if s2 == -1:
		break
	else:
		l2.append(s2)

print("您总共输入了 %d 个有效数字" % len(l2))
print("您输入的最大数是：%d " % max(l2))
print("您输入的最小数是：%d" % min(l2))
print("平均值为：%f" %  (sum(l2)/len(l2)))

print("\n\n-------------------------------------------第三题-------------------------------------\n")
# 3. 写一个程序，输入多行文字，当输入空行时结束输入
#   将原输入的所有字符串存于列表L中
#   (1). 按原来输入的行的顺序反向打印这些行
#      列:
#        输入:hello world
#        输入:welcome to china
#        输入:I like python
#        输入: <回车>
#      显示
#        I like python
#        welcome to china
#        hello world
#   (2). 打印出您共输入了多少文字符?

l3 = []
while(True):
	s3 = input("请您输入文字：")
	if s3=="":
		break
	else:
		l3.append(s3)

l3_tmp = []
l3.reverse()
for s3_2 in l3:
	print(s3_2)
	l3_tmp.extend(s3_2.split(' '))

print("您总共输入了 %d 个文字符!" % len(l3_tmp))


print("\n\n-------------------------------------------第四题-------------------------------------\n")
# 4. 用列表推导式生成 1~100内的奇数的列表
#     结果 [1,3,5,7,.... 99]
# 
#   示例:
#     # 以上练习可以改写为:
#     L = [x for x in range(1, 
#                       100) if x % 2 == 1]

l4 = [s4 for s4 in range(1,100) if s4%2 == 1]
print(l4)



print("\n\n-------------------------------------------第五题-------------------------------------\n")
# 5. 用字符串s = "ABC" 和 s2 = "123" 生成如下列表:
#    ['A1', 'A2', 'A3', 'B1', 'B2', 'B3', 'C1', 'C2', 'C3', ]
s5_1 = "ABC"
s5_2 = "123"

l5 = [x+y for x in s5_1 for y in s5_2]
print(l5)


print("\n\n-------------------------------------------第六题-------------------------------------\n")
# 6. 有一些数存在于列表L 中,如:
#     L = [1,3,2,1,6,4,2,.... 98, 82]
#        (此数据自己定义)
#     将列表L中的数存入于另一个列表L2中（要求,重复出现多次的数字只在L2列表中保留一份)
l6_1 = [1,3,5,7,9,11,2,3,4,7,9,11]
l6_2 = [ x for x in l6_1]
print(set(l6_2))


print("\n\n-------------------------------------------第七题-------------------------------------\n")
# 7. 生成前40个斐波那契数(Fibonacci)
#      1 1 2 3 5 8 13....
#      (自第三个起，之后的所有数为前两个数之和)
#      要求，将这些数保存在列表中，最后打印列表中的这些数
#        提示: 用循环、列表和变量组合可以实现
s7_begin = 0
s7_end = 0
l7 = []

for s7_1 in range(40):
	if s7_1 < 2:
		s7_begin = 1
		s7_end += s7_begin
		l7.append(s7_end)
	else:
		s7_begin = s7_end
		s7_end += s7_begin
		l7.append(s7_end)
else:
	print("前四十个斐波那契数列为：")
	print(l7)
	
		










