# 1.写一个程序，打印一个高度为4的矩形方框
#   要求输入一个整数，此整数代表矩形的宽度，输出此矩形
#   如:
#    请输入宽度: 10
#    打印如下:
#    ##########
#    #        #
#    #        #
#    ##########
print('===================================Day03练习题第一题===================================\n\n')
s1='#'
width=int((input("请输入矩形的宽度")))
print(s1*width+'\n'+s1+(width-2)*' '+s1+'\n'+s1+(width-2)*' '+s1+'\n'+s1*width)


# 2.写一个程序，输入一个字符串，把字符串的第一个字符和最后一个字符去掉，打印出处理后的字符串
print('===================================Day03练习题第二题===================================\n\n')
s2=input("请输入一个字符串：")
print(s2[1:-1])


# 3.输入任意一个字符串，判断这个字符串是否是回文
#   回文是指中心对称的文字，如:
#   上海自来水来自海上
#   ABCCBA
#   12321
print('===================================Day03练习题第三题===================================\n\n')
s3=input("请输入一个字符串：")
mid=len(s3)//2
print('您输入的字符串是回文' if s3[:mid]==s3[-1:(len(s3)-mid-1):-1] else '您输入的字符串不是回文')


print('===================================Day03练习题第四题===================================\n\n')
# 4. 写一个程序，输入一段字符串，如果字符串不为空，则把第一个字符的编码打印出来
s4=input("请输入一个字符串：") or ''
print(s4[0] if s4 is not '' else '您输入的字符串为空')


print('===================================Day03练习题第五题===================================\n\n')
# 5. 写一个程序，输入一个整数值(0~65535)，打印出这个数值所对应的字符
i5 = int(input('请输入一个正整数:'))
print('该整数所对应的字符值是',chr(i5),sep=':')

print('===================================Day03练习题第六题===================================\n\n')
# 6.输入三行文字，让这三行文字在一个方框居中显示
#   如输入(不要输入中文):
#   hello tarena!
#   my name is weimingze
#   python
#   显示如下:
#   +----------------------+
#   |    hello tarena!     |
#   | my name is weimingze |
#   |        python        |
#   +----------------------+
print('请输入三行文字(不要输入中文)：')
s6_1=input('请输入第一行文字：')
s6_2=input('请输入第二行文字：')
s6_3=input('请输入第三行文字：')
len_1=len(s6_1)
len_2=len(s6_2)
len_3=len(s6_3)
max_value=max(len_1,len_2,len_3)
mid_1=(max_value-len_1)//2
mid_2=(max_value-len_2)//2
mid_3=(max_value-len_3)//2
print(' '*mid_1+s6_1)
print(' '*mid_2+s6_2)
print(' '*mid_3+s6_3)



