print("-------------------------------------------第一题-------------------------------------\n")
# 1.练习:
#   经理有: 曹操， 刘备， 周瑜
#   技术员有: 曹操， 周瑜， 张飞，赵云
#   用集合求:
#     1. 即是经理也是技术员的有谁?
#     2. 是经理，但不是技术员的有谁?
#     3. 是技术员，不是经理的都有谁?
#     4. 张飞是经理吗？
#     5. 身兼一职的人有谁?
#     6. 经理和技术员共有几个人?
s1_1 = {'曹操','刘备','周瑜'}
s1_2 = {'曹操','周瑜','张飞','赵云'}

print("既是经理又是技术员的人员：")
print(s1_1&s1_2)
print("\n是精力不是技术员的人员：")
print(s1_1-s1_2)
print("\n是技术人员不是经理的人员：")
print(s1_2-s1_1)
if "张飞" in s1_1:
	print("张飞是经理！")
else:
	print("张飞不是经理！")
	
print("只身兼一职的人：")
print(s1_1 ^ s1_2)

s1_3 = s1_1 | s1_2
print("经理和技术人员总共有 %d 人" % len(s1_3))


print("\n\n-------------------------------------------第二题-------------------------------------\n")
# 2.练习:
#   任意输入一个单词，存入集合中，当输入空字符串时结束输入，
#     1) 打印您输入的单词的种类数(去重)
#     2) 每个单词都打印到终端上显示
#       思考:
#         如何让打印的次序和输入的次序一致?
l2_1 = []
while True:
	s2_1 = input("请输入一个单词：")
	if s2_1 == "":
		break
	l2_1.append(s2_1)

l2_2 = list(set(l2_1))
l2_2.sort(key=l2_1.index)
print(l2_2)


print("\n\n-------------------------------------------第三题-------------------------------------\n")
# 3.练习:
#   1. 模拟一个点名系统，已知全班学生名单，随机打印学生的姓名进行点名，并得到此学生是否已到信息，输入'y'代表已到，其它输入代表未到场
#     点名结束后打印未到者名单
s3_1 = {"张三","李四","王五","赵六"}
s3_2 = set()
for name in s3_1:
	print(name)
	s3 = input()
	if s3 != "y":
		s3_2.add(name)


print("没到的人的名单为",s3_2,sep="：")



print("\n\n-------------------------------------------第四题-------------------------------------\n")
# 4. 写一个函数myfun, 此函数用显示两个参数的相关信息
#    函数:
#      def myfun(a, b):
#          此处自己实现
#   此函数给定两个参数，打印关于两个参数的信息:
#       1) 打印两个参数的最大值
#       2) 打印两个参数的和
#       3) 打印两个参数的积(相乘)
#       4) 打印从a开始到b结束的所有偶数:
#   如:
#     myfun(3, 10)
#   打印如下:
#     最大值是: 10
#     和是: 13
#     积是: 30
#     3到10之间的偶数是: 4 6 8 
#   myfun(10, 20)
#   打印...

def myfun(a,b):
	l4 = [a,b]
	print("最大值为：%d" % max(l4))
	print("和是：%d" % sum(l4))
	print("积是：%d" % (a*b))
	print("从%d到%d所有的偶数为：" % (a,b) )
	l4_1 = [x for x in range(a,b) if x%2 == 0]
	print(l4_1)


s4_a = int(input("请输入a的值："))
s4_b = int(input("请输入b的值："))

myfun(s4_a,s4_b)


print("\n\n-------------------------------------------第五题-------------------------------------\n")
# 5. 猴子吃桃
#   有一只小猴子，摘了很多桃
#     第1天吃了全部桃子的一半，感觉不饱又吃了一个
#     第2天吃了剩下的一半，感觉不饱又吃了一个
#     ... 以此类推
#     到第10天，发现只剩一个了
#   请问第一天摘了多少桃?

s4_1 = int(input("请输入第几天的时候只剩一个桃子："))

def monkey(n):
	s4_peach = 1
	x = 0
	while x < n:
		s4_peach = (s4_peach + 1) * 2
		x += 1
	
	print("桃子总共有 %d 个！" % s4_peach)
		

monkey(s4_1)


print("\n\n-------------------------------------------第六题-------------------------------------\n")
# 6. 完全数:
#   1 + 2 + 3 = 6 (6为完全数)
#   1, 2, 3 都为 6的因数(能被一个数x整数的数为y,则y为x的因数)
#   1 x 6 = 6
#   2 x 3 = 6
#   完全数是指除自身以外，所有的因数相加之和等于自身的数
#   求 4 ~ 5个完全数并打印
#   答案:
#     6
#     28
#     496
#     ....
print("1000以内的完全数为：")
for s6_x in range(2,1000):
	l6_1 = []
	for s6_y in range(1,(s6_x//2+1)):
		if s6_y:
			if s6_x % s6_y == 0:
				l6_1.append(s6_y)
		
	l6_sum = sum(l6_1)
	if l6_sum == s6_x:
		print(l6_sum)
		





			
			
			




