print("-------------------------------------------第一题-------------------------------------\n")
# 1.练习:
#   写程序，实现以下需求:
#     将如下数据形成一个字典seasons
#        '键'    '值'
#        1       '春季有1,2,3月'
#        2       '夏季有4,5,6月'
#        3       '秋季有7,8,9月'
#        4       '冬季有10,11,12月'
#     让用户输入一个整数代表这个季度，打印这个季度的信息，如果用户输入的信息不在字典的键内，则打印信息不存在
d1 = {1:'春季有1,2,3月',2:'夏季有4,5,6月',3:'秋季有7,8,9月',4:'冬季有10,11,12月'}

s1 = int(input("请输入要查询的季度："))

if s1 in d1:
	print(d1[s1])
else:
	print("信息不存在")



print("\n\n-------------------------------------------第二题-------------------------------------\n")
# 2.练习:
#   写程序，输入一段字符串，打印出这个字符串中出现过的字符及出现过的次数:
#     如:
#       输入: ABCDABCABA
#     输出:
#       A : 4次
#       C : 2次
#       B : 3次
#       D : 1次
#     注: 不要求打印的顺序
d2 = {}
s2 = input("请输入一个符串：")
for ch in s2:
	if ch not in d2:
		d2[ch] = 1
	else:
		d2[ch] = d2[ch] + 1
else:
	for s2_key in d2:
		print(s2_key,"%d次" % d2[s2_key],sep="：")
	
print("\n\n-------------------------------------------第三题-------------------------------------\n")
# 3.练习:
#  1. 有字符串列表如下:
#     L = ['tarena', 'xiaozhang', 'xiaowang']
#   生成如下字典:
#     d = {'tarena': 6, 'xiaozhang': 9, 'xiaowang': 8}
#   注: 字典的值是键的长度
# 
#   2. 编号列表如下:
#     Nos = [1001, 1002, 1003, 1004]
#     names = ['Tom', 'Jerry', 'Spike', 'Tyke']
#     生成用Nos数据为键，以names为值的字典，如下:
#       {1001: 'Tom', 1002: 'Jerry', ......}	
l3_1 = ['tarena', 'xiaozhang', 'xiaowang']
d3_1 = {}
for x in l3_1:
	d3_1[x] = len(x)
else:
	print(d3_1)
	
l3_nos = [1001, 1002, 1003, 1004]
l3_names = ['Tom', 'Jerry', 'Spike', 'Tyke']
d3_2 = {x:l3_names[l3_nos.index(x)] for x in l3_nos}
print(d3_2)

print("\n\n-------------------------------------------第四题-------------------------------------\n")
# 4.练习:
#   1. 写一个程序，输入一些单词和解释，将单词作为键，将解释作为值，将这些数据存入字典中.
#     然后:
#       输入查询的单词，显示出此单词的解释 
# 
#   2. 学生管理项目准备工作:
#      写一个程序，任意输入n个学生的信息,形成字典后存于列表中:
#        学生的信息包括:
#           姓名(字符串)
#           年龄(整数)
#           成绩(整数)
#      循环输入学生信息，直到输入学生姓名为空时结束输入,
#      最后形成字典列表如下:
#        L = [
#             {'name':'xiaozhang', 'age':20, 'score': 100},
#             {'name':'xiaoli', 'age':21, 'score': 98},
#             {'name':'xiaowang', 'age':19, 'score': 89},
#             ...
#        ]
#     2) 将以上列表显示为如下的表格:
#     +------------+------+-------+
#     |   name     | age  | score |
#     +------------+------+-------+
#     | xiaozhang  |  20  |  100  |
#     |  xiaoli    |  21  |   98  |
#     | xiaowang   |  19  |   89  |
#     +------------+------+-------+
d4_1 = {}
while True:
	s4_1 = input("请输入单词：")
	s4_2 = input("请输入解释：")
	d4_1[s4_1] = s4_2
	s4_4 = int(input("退出请按输入1，继续请输入2："))
	if s4_4 == 1:
		break

s4_5 = input("请输入要查询的单词：")
print(s4_5,d4_1[s4_5],sep="：",end="\n\n\n")

l4 = []
while True:
	s4_1 = input("姓名：")
	if s4_1 == "":
		break
	s4_2 = int(input("年龄："))
	s4_3 = int(input("成绩："))
	d4_2 = {"name":s4_1,"age":s4_2,"score":s4_3}
	l4.append(d4_2)
	
print(l4)
	
	
	
	
	
	
	
